<template>
  <div class="privacy">
    <NCard title="隐私政策">
      <NDivider />
      <h2>前言</h2>
      <b>
        感谢您使用WeAvatar服务！<br /><br />
        在完成注册程序或以任何方式使用WeAvatar网站服务前，请您务必仔细阅读并透彻理解本网站服务协议(以下或简称“服务协议”)，在确认充分理解后选择接受或不接受本服务协议；一旦您完成“同意协议并注册”或开始以其他方式使用WeAvatar服务，本协议即在您与天津耗子科技有限公司（以下简称“耗子科技”）之间产生法律效力。如您不同意本服务协议或其中任何条款约定，您应不再进行下一步或关闭页面。<br /><br />
        <u> 如您未满18周岁，请您在父母或其他监护人的陪同下阅读并理解本协议。 </u>
        <br /><br />
        <u>
          耗子科技再次提示您审慎阅读、充分理解各条款内容，特别是限制或免除责任的相应条款。本协议中限制、免除责任条款，或者其他涉及您重大权益的条款会以加粗、加下划线等形式提示您重点注意。
        </u>
      </b>
      <br />
      <h3>一、定义</h3>
      1.1.<b>用户：</b>指注册WeAvatar账号，登录、浏览WeAvatar网站，或者使用WeAvatar服务的自然人、法人或非法人组织，亦简称“您”。<br />
      1.2.<b>耗子科技：</b>指天津耗子科技有限公司，是WeAvatar网站的运营者。<br />
      1.2.<b>WeAvatar：</b>指天津耗子科技有限公司运营的WeAvatar网站，包括但不限于WeAvatar网站、WeAvatarAPP、WeAvatar小程序等。<br />
      1.3.<b>第三方账号：</b>指WeAvatar认可的，用来注册、登录WeAvatar账号的第三方平台账号，如微信、QQ、微博、支付宝等。<br />
      1.4.<b>法律法规：</b>包含有权国家机关颁布的法律、行政法规、部门规章和其他规范性文件，以及其不时发布的政策、要求、决定或命令。<br />
      <h3>二、账号的注册使用</h3>
      <h4>2.1.账号注册资格</h4>
      2.1.1.在您完成注册程序或以其他WeAvatar允许的方式实际使用本服务时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。<br />
      2.1.2.
      <b>
        若您是未成年人或限制民事行为能力人，则您不具备前述主体资格，您及您的监护人应承担因您的不当注册行为而导致的一切后果。
      </b>
      <br />
      2.1.3.您还需确保您不是任何国家、国际组织或者地域实施的贸易限制、制裁或其他法律、规则限制的对象，否则您可能无法正常注册及使用WeAvatar服务。<br />
      <h4>2.2.账号注册</h4>
      2.2.1.
      <b>
        当您按照注册页面提示填写信息、阅读并同意本服务条款且完成全部注册程序后，您可获得WeAvatar账号的使用权。
      </b>
      <br />
      2.2.2.您可以通过设置或确认的登录名及您设置的密码完成注册程序；您可选择通过设置登陆手机号码并完成动态验证、授权使用第三方账号关联注册或WeAvatar提供的其他注册方式，完成WeAvatar账号的注册。在您通过某一形式注册账号时，WeAvatar可能会为您自动生成一个“账号ID”。您理解并同意，当提及您的WeAvatar账号时，实际是指上述账号登录名与密码、登陆手机号、被授权的第三方账号或在用户界面内归属在“我的通行证”下的其他信息的统称。<br />
      2.2.3.您设置的昵称不得违反国家法律法规、公序良俗、社会公德、WeAvatar的管理规范或容易引起您与WeAvatar身份的混淆，否则您的账号可能无法注册成功或WeAvatar有权经通知您后予以注销。<br />
      2.2.4.您应当按照法律法规要求或按相应页面的提示，准确提供并及时更新您的账号信息，以使之真实、及时、完整和准确。如您提供的资料错误、不实、过时或不完整的，WeAvatar可以向您发出询问及/或要求改正的通知，您应按照WeAvatar的要求配合提供或者更新相关资料。
      <b>
        因您填写的信息、资料不真实、不及时、不完整或不准确的，您应承担您不能使用WeAvatar账号（不能注册成功、或账号被冻结、注销）或您在使用过程中的后果和损失。
      </b>
      <br />
      2.2.5.
      <b>
        WeAvatar可能会就某些功能、服务的开通，要求您提供更多的身份资料和信息，做进一步的身份认证或资格验证，您的账号只有在通过这些认证和验证之后，方可获得使用相关功能、服务的资格。
      </b>
      <br />
      2.2.6.通常情况下，您的WeAvatar账号是您在耗子科技旗下网站进行一切活动的唯一身份标识，除非另有约定，每一个WeAvatar账号都可以在本网站独立开展活动。但在下列情形下，耗子科技有权根据自己的判断，对同一及/或关联法律主体拥有的多个WeAvatar账号进行统一处理，如根据不同WeAvatar账号在注册、登录、使用中的关联信息，WeAvatar判断其实际为同一用户。关联信息举例：同一证件、同一手机号、同一支付账号、同一设备、同一地址等。<br />
      <h4>2.3.账号的使用</h4>
      2.3.1.您有权使用您设定的账号登录WeAvatar网站，进而使用WeAvatar提供的服务。您知悉并同意，耗子科技有权不时变更、暂停或取消任何一项服务（包括产品种类增加或减少、服务内容的调整、版本升级等）或整个服务，或不时变更、暂停或取消服务的某种特性或功能，或者不时变更、暂停或取消服务的使用方式及有关服务内容。该等变更、暂停或取消将在WeAvatar官网上公布，以便通知到您。您有义务及时查收并透彻理解相关调整内容，如您不同意变更后的任何条款，请勿继续使用相关服务。如您使用WeAvatar提供的服务，即视为您同意遵守届时公示的服务条款及该具体服务服务条款的最新版本及其任何条款。<br />
      2.3.2.耗子科技可能会以邮件、站内信、短信或电话等方式通知您相关服务进展情况以及提示您进行下一步的操作。在服务过程中您应当及时登录到WeAvatar账号查看和进行操作。<br />
      2.3.3.一个WeAvatar账号仅能对应唯一的法律主体。除非有法律明文规定、司法裁定或者经耗子科技同意的情况下，您不得以任何方式转让、转借、租售、赠与或让他人继承您的WeAvatar账号。<br />
      2.3.4.<b>您的账号信息由您自行设置并由您保管，您须对您的WeAvatar账号和密码、手机验证码及其他与账号相关的信息、资料予以保密。</b>您需确保您在每个上网时段结束时，以正确步骤离开网站。<br />
      2.3.5.如发现他人未经授权使用您的WeAvatar账号，您应立即通知耗子科技；耗子科技将协助您冻结账号、更改密码或进行其他安全设置；
      <b>
        您理解耗子科技对您的请求采取行动需要合理时间，耗子科技对在采取行动前已经产生的以及由您引发的后果（包括但不限于您的任何损失）不承担任何责任。
      </b>
      <br />
      2.3.6.耗子科技亦会在网站服务端采取合理的技术措施保障账号的安全。<br />
      <h3>三、账号的冻结、注销及申诉</h3>
      <h4>3.1.账号的冻结</h4>
      您的WeAvatar账号（全部或部分权限或功能）在如下情况可能被冻结（例如，WeAvatar账号被限制登陆；被限制功能等），耗子科技将通过邮件、站内信、短信或电话等方式通知您：<br />
      3.1.1.基于WeAvatar网站或服务运行和交易安全的需要，如您发生或可能发生破坏或试图破坏WeAvatar或耗子科技关联公司公平交易环境或正常交易秩序的，或任何使用含有耗子科技或耗子科技关联公司名称、品牌且对他人有误导嫌疑或任何使用某种中英文(全称或简称)、数字、域名等意图表示或映射与耗子科技或其关联公司具有某种关联的；<br />
      3.1.2.违反本服务条款、WeAvatar网站的相关规则、规范（如平台安全规则、应用规则、管理规范等）、服务说明以及其他服务协议/条款的；<br />
      3.1.3.违反国家法律、法规、政策、法律文书的规定的；<br />
      3.1.4.您遭到他人投诉，且对方已经提供了相关证据的，而您未按照我们的要求提供相反证据的；<br />
      3.1.5.耗子科技根据合理分析判断您的账号操作、收益、兑换等存在异常的；<br />
      3.1.6.国家有权机关要求进行的冻结的；<br />
      3.1.7.耗子科技合理判断，同一用户发生与如上行为性质相同或产生如上类似风险的其他情况的。<br />
      <h4>3.2.账号的注销</h4>
      3.2.1.出现以下情形之一的，您的WeAvatar账号将被注销：<br />
      3.2.1.1.耗子科技依据您本人提交的账号注销申请，依照法律的规定和账号注销流程，处理您提交的注销请求并完成账号注销的。<br />
      3.2.1.2.当出现如上第3.1条情形且情形严重的，或基于国家有权机关的要求，耗子科技对您的相关WeAvatar账号进行注销，耗子科技将通过邮件、短信、电话或其他适宜的方式通知您。<br />
      3.2.1.3.当您连续12个月未通过账号登录过WeAvatar网站（含账号冻结期间），且您的账号下不存在任何使用中的服务，耗子科技有权（但无义务）注销您的账号。<br />
      3.2.2.您理解并同意，账号一经注销，您将：<br />
      3.2.2.1无法再次登录WeAvatar网站、论坛、App等；<br />
      3.2.2.2无法访问用户中心或应用管理面板等；<br />
      3.2.2.3无法进行依赖于账号权限进行的其他操作；<br />
      3.2.2.4无法找回该账号下的个人信息、交易记录、业务数据、历史信息等。<br />
      3.2.2.5
      <b> 但账号注销并不代表您在该账号注销前的所有账号行为和相关责任得到豁免或减轻。 </b>
      <br />
      3.2.3账号注销后，耗子科技将：<br />
      3.2.3.1无权继续收集、存储和使用您的个人信息和数据，但法律法规另有要求的情形除外，例如：为了税务合规而保留相应的发票信息等；<br />
      3.2.3.2有义务在遵守国家法律法规的前提下，保障您在该账号下的所有数据在实现日常业务功能所涉及的系统中不可被检索、访问；<br />
      3.2.3.3
      <b>
        账号注销不影响耗子科技在监管机关要求或其他合法场景下，依法确认该账号注销前的用户真实身份等相关义务的履行。
      </b>
      <br />
      <h4>3.3.申诉</h4>
      发生前述账号冻结或注销情况下，您应及时予以关注并可以按照程序进行申诉等后续操作：<br />
      3.3.1.您通过申诉程序，向耗子科技申请解除上述冻结或注销的，为了您的账号安全，您应配合如实提供身份证明及相关资料，以及WeAvatar要求的其他信息或文件，以便耗子科技进行核实。您应充分理解您的申诉并不必然被允许，耗子科技有权决定是否同意您的申诉请求。<br />
      3.3.2.您理解并同意，如果您拒绝如实提供身份证明及相关资料，或未能通过耗子科技审核，耗子科技有权长期冻结该等账号且长期限制账号部分或全部功能，直至前述情形被得以合理纠正，或基于第3.2.1.3条的约定注销该账号。<br />
      3.4您理解并同意，您名下如存在多个WeAvatar账号，因您的违法、违规、违约行为导致其中一个或多个账号被冻结或注销的，耗子科技有权根据具体情形及相关风险程度作合理判断，对您的其他全部或部分账号予以冻结或注销。<br />
      <h3>四、网站服务及规范</h3>
      4.1.您有权享受耗子科技通过本网站提供的互联网技术服务和信息服务。您同时还应根据本服务条款以及您在使用具体服务时确认的相关条款和条件，履行合理使用、服务管理等责任。<br />
      <h4>4.2.您使用WeAvatar服务时，您应保证：</h4>
      4.2.1.您使用WeAvatar服务时将遵从国家、地方法律法规、行业惯例和社会公共道德，不会利用WeAvatar提供的服务进行存储、发布、传播如下信息和内容：<br />
      （ⅰ）违反国家法律法规政策的任何内容（信息）；<br />
      （ⅱ）违反国家规定的政治宣传和/或新闻信息；<br />
      （ⅲ）涉及国家秘密和/或安全的信息；<br />
      （ⅳ）封建迷信和/或淫秽、色情、下流的信息或教唆犯罪的信息；<br />
      （ⅴ）博彩有奖、赌博游戏；违反国家民族和宗教政策的信息；<br />
      （ⅵ）妨碍互联网运行安全的信息；<br />
      （ⅶ）侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容；<br />
      （ⅷ）您同时承诺不得为他人发布上述不符合国家规定和/或本服务条款约定的信息内容提供任何便利，包括但不限于设置URL、BANNER链接等；<br />
      4.2.2.不应出现任何破坏或试图破坏网络安全等的行为，包括不会利用技术或其他手段破坏或扰乱本网站及耗子科技其他的网站；<br />
      4.2.3.您使用WeAvatar网站的服务应符合本服务条款；<br />
      如您违反上述保证，耗子科技除有权根据相关服务条款采取删除信息、中止服务、终止服务的措施，并有权冻结或注销您账号部分或全部功能。<br />
      <h3>五、隐私及个人信息的保护</h3>
      5.1.为及时跟进您的需求，我们可能会将您提供的联系人信息或账号数据（包含姓名、电子邮箱地址、电话号码、职务等）、您的公司基本信息以及项目服务信息录入到我们的客户关系管理（CRM）系统，
      <b>
        与您对接的服务顾问将有权限查看前述信息并在必要时与您进行联络。您同意我们将您的信息用于上述目的。
      </b>
      <br />
      <h3>七、保密</h3>
      <h4>
        耗子科技承诺对您注册账号时或使用WeAvatar服务时提交或知悉的信息采取保密措施，不向第三方披露您的信息，除非：
      </h4>
      7.1.依据本服务条款或者您与耗子科技之间其他服务协议、合同、在线条款等规定可以提供的；<br />
      7.2.依据法律法规的规定或行政、司法等职权部门要求应当提供的；<br />
      7.3.在不违反本服务条款约定责任的前提下，该保密信息已经公开或能从公开领域获得；<br />
      7.4.为提供您要求的服务所必需。<br />
      <h3>八、出口管制</h3>
      双方承诺遵守本协议所适用的联合国、中国、美国以及其他国家出口管制法律法规。您承诺不会将WeAvatar提供的产品或服务用于适用的出口管制法律法规禁止的用途。非经相关主管机关许可，您及您授权使用WeAvatar产品或服务的其他个人或实体不会通过WeAvatar产品或服务向适用的出口管制法律法规禁止的实体或个人提供受管控的技术、软件或服务。<br />
      <h3>九、信息安全事件</h3>
      WeAvatar将基于耗子安全应急响应中心及时响应信息安全事件，并依据国家法律法规的要求、遵照相关安全事件处理标准管理信息安全事件。当发生涉及您相关资产的信息安全事件时，我们会依法及时将事件相关的情况通过邮件、信函、电话、推送通知等方式告知，您也可通过工单、客服、电话等方式主动联系我们。<br />
      <h3>十、责任范围和责任限制</h3>
      10.1.您了解并同意，您应承担因您使用本服务、违反本服务条款或在您的账号下采取的任何行动而导致的任何第三方索赔。如果由此引起耗子科技及其关联公司、员工、客户和合作伙伴被第三方索赔的，您应负责处理，并赔偿耗子科技及其关联公司由此遭受的全部损失和责任。<br />
      10.2.在适用法律许可的范围内，
      <b>
        耗子科技不对与本服务条款有关或由本服务条款引起的任何间接的、惩罚性的、特殊的、派生的损失承担赔偿责任。
      </b>
      <br />
      10.3.耗子科技在此提示，
      <b>
        您在使用WeAvatar服务期间应当遵守中华人民共和国的法律，不得危害网络安全，不得利用WeAvatar的服务从事侵犯他人名誉、隐私、知识产权和其他合法权益的活动。耗子科技不对您使用WeAvatar服务的违法或违约行为承担任何责任。
      </b>
      <br />
      10.4.您在WeAvatar网站上自行上传、提供、发布相关信息，包括但不限于用户名称、公司名称、联系人及联络信息，相关图片、资讯等，均由您自行提供，
      <b> 您须对其提供的前述信息依法承担全部责任。 </b>
      <br />
      10.5.如果您通过使用WeAvatar网站或获取来自第三方的任何产品或服务，例如，第三方平台、服务通过接入WeAvatar向您提供服务，
      <b> 该平台将对其提供的服务向您负责，耗子科技对此第三方平台、服务不承担任何责任。 </b>
      <br />
      10.6.在某些情况下，为了帮助您更便捷的使用WeAvatar服务，耗子科技可能会展示WeAvatar的参考代码或软件（如属于第三方开源软件，您则应遵守第三方开源软件的相关使用要求），基于相应展示页面的使用说明，该等软件可能允许您予以下载、进行二次开发等相关操作，您应理解并承诺，该等代码的知识产权属于耗子科技，您在使用时应明确表明权利人，同时，耗子科技不对您能否使用以及使用该等代码、软件的工作和后果负责。<br />
      <h3>十一、不可抗力和意外事件</h3>
      <h4>
        WeAvatar网站及其服务是按照现有技术和条件所能达到的现状提供的，耗子科技会尽最大努力保障服务的连贯性和安全性，但不能随时预见和防范法律、技术以及其他风险，在法律允许的范围内，如因下列不可抗力或意外事件无法正常提供服务的，耗子科技不承担任何法律责任：
      </h4>
      11.1.不可抗力，即双方所不能预见、并且它的发生及其后果是不能克服和不能避免的客观情况，包括但不限于如下情形：<br />
      （1）自然灾害如洪水、冰雹、海啸、台风、旱灾、火灾；<br />
      （2）社会因素如罢工、暴乱、战争及所适用的政策、法律、法规导致不能履行；<br />
      11.2.因电力供应故障、通讯网络故障等公共服务因素；<br />
      11.3.因黑客攻击、病毒、您自身软硬件设备异常等非耗子科技独立责任；<br />
      11.4.经提前公告或通知的，WeAvatar在短时间内的系统维护（包括但不限于排除故障、系统升级、系统扩容、服务器迁移等）。<br />
      <h3>十二、法律适用与管辖</h3>
      本服务条款之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本服务条款产生之争议应提交至天津市武清区人民法院解决。<br />
      <h3>十三、通知送达</h3>
      13.1.您理解并同意，耗子科技可通过网页公告、电子邮件、站内信、短信、电话、系统消息以及即时通信等以上一种或多种通知方式向您发送通知，且耗子科技可以信赖您所提供的联系信息是完整、准确且当前有效的；上述通知在发送成功后视为已送达。<br />
      13.2．除非本服务条款另有约定或耗子科技与您另行签订的协议明确规定了通知方式，您发送给耗子科技的通知，应当通过耗子科技对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。<br />
      <h3>十四、协议的更新和终止</h3>
      14.1.耗子科技有权对本服务协议及相应的协议条款内容进行变更，并将网页公告、电子邮件、站内信、短信等方式予以公告或通知；
      <b>
        若您在本服务协议内容变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的内容，也将遵循修改后的协议内容。
      </b>
      <br />
      14.2.在您的账号注销或经双方协商一致终止网站服务的，本服务条款终止。<br />
      <h3>十五、其他</h3>
      15.1.本服务协议由本服务协议的内容、网站相关页面上展现的规则、规范，服务说明（含操作文档）和您点击确认的其他条款/条件组成，耗子科技和您均受其约束，且其中的相关名词可相互引用、解释。<br />
      15.2.本服务协议的章节标题仅为行文方便而设，不具有法律或合同效力。<br />
      15.3.
      <b>
        本服务协议任一条款被视为废止、无效或不可执行，该条款应视为可分的且不影响本服务协议及其他条款的有效性及可执行性。
      </b>
      <br />
      15.4.耗子科技有权在WeAvatar网站上发布公告、发送站内通知或邮件通知等方式将本服务的权利义务全部或者部分转移给耗子科技的关联公司。<br />
      15.5.除另有约定外，出于服务专业性考虑，耗子科技亦可能委托关联公司或其他法律主体向您提供WeAvatar网站上一项或多项具体服务，同时您可能会与该公司订立相关条款或条件，
      <b> 请您审慎阅读、充分理解条款和条件内容，选择接受或不接受该条款和条件。 </b>
      <br />
      15.6.
      <b>
        本服务协议项下之保密条款、知识产权条款、法律适用与管辖条款以及性质上理应存续的其他条款（如对注册信息的真实性保证等），不因本协议的终止而失效。
      </b>
      <br />
    </NCard>
  </div>
</template>

<script setup lang="ts">
import { NCard, NDivider } from 'naive-ui'
</script>

<style scoped>
.privacy {
  padding: 100px;
}

@media screen and (max-width: 719px) {
  .privacy {
    padding: 100px 0 100px 0;
  }
}
</style>
